###################################################################

# Created by write_sdc on Thu Apr 10 19:47:29 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions NCCOM -library tcbn65lptc
set_max_area 0
set_input_transition -max 0.12  [get_ports {a[31]}]
set_input_transition -min 0.12  [get_ports {a[31]}]
set_input_transition -max 0.12  [get_ports {a[30]}]
set_input_transition -min 0.12  [get_ports {a[30]}]
set_input_transition -max 0.12  [get_ports {a[29]}]
set_input_transition -min 0.12  [get_ports {a[29]}]
set_input_transition -max 0.12  [get_ports {a[28]}]
set_input_transition -min 0.12  [get_ports {a[28]}]
set_input_transition -max 0.12  [get_ports {a[27]}]
set_input_transition -min 0.12  [get_ports {a[27]}]
set_input_transition -max 0.12  [get_ports {a[26]}]
set_input_transition -min 0.12  [get_ports {a[26]}]
set_input_transition -max 0.12  [get_ports {a[25]}]
set_input_transition -min 0.12  [get_ports {a[25]}]
set_input_transition -max 0.12  [get_ports {a[24]}]
set_input_transition -min 0.12  [get_ports {a[24]}]
set_input_transition -max 0.12  [get_ports {a[23]}]
set_input_transition -min 0.12  [get_ports {a[23]}]
set_input_transition -max 0.12  [get_ports {a[22]}]
set_input_transition -min 0.12  [get_ports {a[22]}]
set_input_transition -max 0.12  [get_ports {a[21]}]
set_input_transition -min 0.12  [get_ports {a[21]}]
set_input_transition -max 0.12  [get_ports {a[20]}]
set_input_transition -min 0.12  [get_ports {a[20]}]
set_input_transition -max 0.12  [get_ports {a[19]}]
set_input_transition -min 0.12  [get_ports {a[19]}]
set_input_transition -max 0.12  [get_ports {a[18]}]
set_input_transition -min 0.12  [get_ports {a[18]}]
set_input_transition -max 0.12  [get_ports {a[17]}]
set_input_transition -min 0.12  [get_ports {a[17]}]
set_input_transition -max 0.12  [get_ports {a[16]}]
set_input_transition -min 0.12  [get_ports {a[16]}]
set_input_transition -max 0.12  [get_ports {a[15]}]
set_input_transition -min 0.12  [get_ports {a[15]}]
set_input_transition -max 0.12  [get_ports {a[14]}]
set_input_transition -min 0.12  [get_ports {a[14]}]
set_input_transition -max 0.12  [get_ports {a[13]}]
set_input_transition -min 0.12  [get_ports {a[13]}]
set_input_transition -max 0.12  [get_ports {a[12]}]
set_input_transition -min 0.12  [get_ports {a[12]}]
set_input_transition -max 0.12  [get_ports {a[11]}]
set_input_transition -min 0.12  [get_ports {a[11]}]
set_input_transition -max 0.12  [get_ports {a[10]}]
set_input_transition -min 0.12  [get_ports {a[10]}]
set_input_transition -max 0.12  [get_ports {a[9]}]
set_input_transition -min 0.12  [get_ports {a[9]}]
set_input_transition -max 0.12  [get_ports {a[8]}]
set_input_transition -min 0.12  [get_ports {a[8]}]
set_input_transition -max 0.12  [get_ports {a[7]}]
set_input_transition -min 0.12  [get_ports {a[7]}]
set_input_transition -max 0.12  [get_ports {a[6]}]
set_input_transition -min 0.12  [get_ports {a[6]}]
set_input_transition -max 0.12  [get_ports {a[5]}]
set_input_transition -min 0.12  [get_ports {a[5]}]
set_input_transition -max 0.12  [get_ports {a[4]}]
set_input_transition -min 0.12  [get_ports {a[4]}]
set_input_transition -max 0.12  [get_ports {a[3]}]
set_input_transition -min 0.12  [get_ports {a[3]}]
set_input_transition -max 0.12  [get_ports {a[2]}]
set_input_transition -min 0.12  [get_ports {a[2]}]
set_input_transition -max 0.12  [get_ports {a[1]}]
set_input_transition -min 0.12  [get_ports {a[1]}]
set_input_transition -max 0.12  [get_ports {a[0]}]
set_input_transition -min 0.12  [get_ports {a[0]}]
set_input_transition -max 0.12  [get_ports {b[31]}]
set_input_transition -min 0.12  [get_ports {b[31]}]
set_input_transition -max 0.12  [get_ports {b[30]}]
set_input_transition -min 0.12  [get_ports {b[30]}]
set_input_transition -max 0.12  [get_ports {b[29]}]
set_input_transition -min 0.12  [get_ports {b[29]}]
set_input_transition -max 0.12  [get_ports {b[28]}]
set_input_transition -min 0.12  [get_ports {b[28]}]
set_input_transition -max 0.12  [get_ports {b[27]}]
set_input_transition -min 0.12  [get_ports {b[27]}]
set_input_transition -max 0.12  [get_ports {b[26]}]
set_input_transition -min 0.12  [get_ports {b[26]}]
set_input_transition -max 0.12  [get_ports {b[25]}]
set_input_transition -min 0.12  [get_ports {b[25]}]
set_input_transition -max 0.12  [get_ports {b[24]}]
set_input_transition -min 0.12  [get_ports {b[24]}]
set_input_transition -max 0.12  [get_ports {b[23]}]
set_input_transition -min 0.12  [get_ports {b[23]}]
set_input_transition -max 0.12  [get_ports {b[22]}]
set_input_transition -min 0.12  [get_ports {b[22]}]
set_input_transition -max 0.12  [get_ports {b[21]}]
set_input_transition -min 0.12  [get_ports {b[21]}]
set_input_transition -max 0.12  [get_ports {b[20]}]
set_input_transition -min 0.12  [get_ports {b[20]}]
set_input_transition -max 0.12  [get_ports {b[19]}]
set_input_transition -min 0.12  [get_ports {b[19]}]
set_input_transition -max 0.12  [get_ports {b[18]}]
set_input_transition -min 0.12  [get_ports {b[18]}]
set_input_transition -max 0.12  [get_ports {b[17]}]
set_input_transition -min 0.12  [get_ports {b[17]}]
set_input_transition -max 0.12  [get_ports {b[16]}]
set_input_transition -min 0.12  [get_ports {b[16]}]
set_input_transition -max 0.12  [get_ports {b[15]}]
set_input_transition -min 0.12  [get_ports {b[15]}]
set_input_transition -max 0.12  [get_ports {b[14]}]
set_input_transition -min 0.12  [get_ports {b[14]}]
set_input_transition -max 0.12  [get_ports {b[13]}]
set_input_transition -min 0.12  [get_ports {b[13]}]
set_input_transition -max 0.12  [get_ports {b[12]}]
set_input_transition -min 0.12  [get_ports {b[12]}]
set_input_transition -max 0.12  [get_ports {b[11]}]
set_input_transition -min 0.12  [get_ports {b[11]}]
set_input_transition -max 0.12  [get_ports {b[10]}]
set_input_transition -min 0.12  [get_ports {b[10]}]
set_input_transition -max 0.12  [get_ports {b[9]}]
set_input_transition -min 0.12  [get_ports {b[9]}]
set_input_transition -max 0.12  [get_ports {b[8]}]
set_input_transition -min 0.12  [get_ports {b[8]}]
set_input_transition -max 0.12  [get_ports {b[7]}]
set_input_transition -min 0.12  [get_ports {b[7]}]
set_input_transition -max 0.12  [get_ports {b[6]}]
set_input_transition -min 0.12  [get_ports {b[6]}]
set_input_transition -max 0.12  [get_ports {b[5]}]
set_input_transition -min 0.12  [get_ports {b[5]}]
set_input_transition -max 0.12  [get_ports {b[4]}]
set_input_transition -min 0.12  [get_ports {b[4]}]
set_input_transition -max 0.12  [get_ports {b[3]}]
set_input_transition -min 0.12  [get_ports {b[3]}]
set_input_transition -max 0.12  [get_ports {b[2]}]
set_input_transition -min 0.12  [get_ports {b[2]}]
set_input_transition -max 0.12  [get_ports {b[1]}]
set_input_transition -min 0.12  [get_ports {b[1]}]
set_input_transition -max 0.12  [get_ports {b[0]}]
set_input_transition -min 0.12  [get_ports {b[0]}]
set_input_transition -max 0.12  [get_ports {rnd[2]}]
set_input_transition -min 0.12  [get_ports {rnd[2]}]
set_input_transition -max 0.12  [get_ports {rnd[1]}]
set_input_transition -min 0.12  [get_ports {rnd[1]}]
set_input_transition -max 0.12  [get_ports {rnd[0]}]
set_input_transition -min 0.12  [get_ports {rnd[0]}]
