reset_design
1
set_max_area 0 
1
create_clock -period 3 -name MAIN_CLOCK [get_ports clk_i];
Warning: Can't find port 'clk_i' in design 'mul_float32'. (UID-95)
Error: Value for list 'source_objects' must have 1 elements. (CMD-036)
0
set_clock_uncertainty -setup 0.2 [get_clocks MAIN_CLOCK]
Warning: Can't find clock 'MAIN_CLOCK' in design 'mul_float32'. (UID-95)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
set_clock_latency -source -max 0.2 [get_clocks MAIN_CLOCK]
Warning: Can't find clock 'MAIN_CLOCK' in design 'mul_float32'. (UID-95)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
set_clock_latency -max 0.2 [get_clocks MAIN_CLOCK]
Warning: Can't find clock 'MAIN_CLOCK' in design 'mul_float32'. (UID-95)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
set_clock_transition 0.5 [get_clocks MAIN_CLOCK]
Warning: Can't find clock 'MAIN_CLOCK' in design 'mul_float32'. (UID-95)
Error: Value for list 'clock_list' must have 1 elements. (CMD-036)
0
set_input_delay -max 0.5 -clock MAIN_CLOCK [all_inputs]
Warning: Can't find clock 'MAIN_CLOCK' in design 'mul_float32'. (UID-95)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
0
//set_input_delay -min 2.0 -clock MAIN_CLOCK [all_inputs]
Error: unknown command '//set_input_delay' (CMD-005)
remove_input_delay [get_ports "clk_i VDD VSS"]
Warning: Can't find port 'clk_i' in design 'mul_float32'. (UID-95)
Warning: Can't find port 'VDD' in design 'mul_float32'. (UID-95)
Warning: Can't find port 'VSS' in design 'mul_float32'. (UID-95)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set_input_delay -max 0.5 -clock MAIN_CLOCK [get_ports resetn_i]
Warning: Can't find port 'resetn_i' in design 'mul_float32'. (UID-95)
Warning: Can't find clock 'MAIN_CLOCK' in design 'mul_float32'. (UID-95)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
//set_input_delay -min 2.0 -clock MAIN_CLOCK [get_ports resetn_i]
Warning: Can't find port 'resetn_i' in design 'mul_float32'. (UID-95)
Error: unknown command '//set_input_delay' (CMD-005)
set_output_delay -max 0.5 -clock MAIN_CLOCK [all_outputs]
Warning: Can't find clock 'MAIN_CLOCK' in design 'mul_float32'. (UID-95)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
0
//set_output_delay -min -2.0 -clock MAIN_CLOCK [all_outputs]
Error: unknown command '//set_output_delay' (CMD-005)
remove_output_delay [get_ports "VDD VSS"]
Warning: Can't find port 'VDD' in design 'mul_float32'. (UID-95)
Warning: Can't find port 'VSS' in design 'mul_float32'. (UID-95)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
//set_isolate_ports [remove_from_collection [all_outputs] [get_ports MAIN_VDD MAIN_VSS]]
Error: extra positional option 'MAIN_VSS' (CMD-012)
//set_load [expr 30.0/1000] [remove_from_collection [all_outputs] [get_ports MAIN_VDD MAIN_VSS]]
Error: extra positional option 'MAIN_VSS' (CMD-012)
//set_input_transition 0.12 [remove_from_collection [all_inputs] [get_ports MAIN_VDD MAIN_VSS clk_i]]
Error: extra positional option 'MAIN_VSS' (CMD-012)
Error: extra positional option 'clk_i' (CMD-012)
set_input_transition 0.12 [remove_from_collection [all_inputs] [get_ports clk_i]]
Warning: Can't find port 'clk_i' in design 'mul_float32'. (UID-95)
1
set_operating_conditions -max "NCCOM"
Using operating conditions 'NCCOM' found in library 'tcbn65lptc'.
1
set_ideal_network [get_ports "clk_i resetn_i"]
Warning: Can't find port 'clk_i' in design 'mul_float32'. (UID-95)
Warning: Can't find port 'resetn_i' in design 'mul_float32'. (UID-95)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
# group_path -name INPUTS -from [all_inputs]
# 
# group_path -name OUTPUTS -to [all_outputs]
# 
# group_path -name COMBO -from [all_inputs] -to [all_outputs]
# 
# group_path -name MAIN_CLOCK -weight 5 -critical 0.5
# 
# group_path -name INPUTS -weight 1 -critical 0.5
# 
# group_path -name OUTPUTS -weight 1 -critical 0.5
# 
# group_path -name COMBO -weight 5 -critical 1.0
set_fix_multiple_port_nets -all -buffer_constants; 
1
set verilogout_no_tri true
true
set hdlin_check_no_latch true
true
set_fix_hold [all_clocks]
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
0
0
